Tekla Open API Reference for Tekla Structures 2025
RebarLegFace.Id Property
 Gets or sets an identifier that may be used to identify instances of the same rebar leg face.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Id { get; set; }
Public Property Id As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RebarLegFace Class
Tekla.Structures.Model Namespace